Public Attributes | List of all members
API_StairStructureDrainingData Struct Reference
Element Manager API
Represents the draining of a monolithic Stair Structure element. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | enabled
True, if structure draining is enabled.
double  | width
Width of the draining.
double  | offset
Offset from boundary.
double  | horizontalDepth
Draining vertical depth.
double  | verticalDepth
Draning horizontal depth.
API_OverriddenAttribute  | material
Material of the draining.
API_StairDrainSurfaceTypeID  | surfaceType
Surface type of the draining: |APIST_Stepped|Stepped structure draining.| |APIST_Smooth|Smooth structure draining.|.
Detailed Description
Represents the draining of a monolithic Stair Structure element.
Member Data Documentation
◆ enabled
 API_StairStructureDrainingData::enabled
True, if structure draining is enabled.
◆ horizontalDepth
 API_StairStructureDrainingData::horizontalDepth
Draining vertical depth.
◆ material
 API_StairStructureDrainingData::material
Material of the draining.
◆ offset
 API_StairStructureDrainingData::offset
Offset from boundary.
◆ surfaceType
 API_StairStructureDrainingData::surfaceType
Surface type of the draining: |APIST_Stepped|Stepped structure draining.| |APIST_Smooth|Smooth structure draining.|.
◆ verticalDepth
 API_StairStructureDrainingData::verticalDepth
Draning horizontal depth.
◆ width
 API_StairStructureDrainingData::width
Width of the draining.